{
  "backend/main.mo": "Main actor implementing user profiles with picture storage, access control, social features like friend requests, and search functionality.",
  "backend/migration.mo": "Migration module converting old user, room, and message data into a new structure supporting profile pictures, room members, friendships, and image messages.",
  "feature_evidence.json": "Feature evidence report mapping major features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of key frontend components, hooks, and styles used across the application.",
  "frontend/index.css": "Global Tailwind-based styling defining warm color palettes and light/dark theme variables.",
  "frontend/index.html": "Basic HTML entry point loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React app managing authentication, profile setup/editing, settings, friends, room selection, and message display.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with React Query cache clearing and error handling.",
  "frontend/src/components/chat/InviteToRoomDialog.tsx": "Dialog for listing friends and inviting one to a room, with loading states and friend preview cards.",
  "frontend/src/components/chat/MessageComposer.tsx": "Message input component allowing text and image upload with validation, previews, upload progress, and send handling.",
  "frontend/src/components/chat/MessageThread.tsx": "Displays a scrollable list of messages with sender info, images, and auto‑scrolling, plus an invite dialog and composer.",
  "frontend/src/components/chat/RoomList.tsx": "Lists chat rooms and allows creating new rooms, handling loading, errors, and room selection.",
  "frontend/src/components/friends/FriendsDialog.tsx": "Dialog for viewing existing friends and searching users, with friend cards, search results, and request actions.",
  "frontend/src/components/profile/ProfileEditorDialog.tsx": "Dialog for editing a user profile with name, bio, avatar color, and image upload handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial profile setup dialog allowing users to enter name and bio and save their profile.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user's avatar using a profile picture or a colored initial fallback.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Settings dialog for choosing theme and adjusting message polling interval.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useChatRooms.ts": "Hooks to list chat rooms and create new rooms via the backend actor.",
  "frontend/src/hooks/useFriends.ts": "Hooks for searching users, retrieving friends, and sending or accepting friend requests.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/useRoomMembers.ts": "Mutation hook to add a user to a room and refresh the room list.",
  "frontend/src/hooks/useRoomMessages.ts": "Hooks for fetching room messages with polling and posting new messages.",
  "frontend/src/hooks/useUserPreferences.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks to load and update caller or arbitrary user profiles via an actor instance, with cache invalidation on profile save.",
  "frontend/src/index.css": "Tailwind base styles defining light/dark theme color variables and applying global background, text, and border styles.",
  "frontend/src/main.tsx": "App entry point that mounts React, sets up React Query, and wraps the app in the Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL parameters, persisting them in session storage, and managing hash-based parameter cleanup.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme tokens, colors, typography, animations, and enabling plugins.",
  "project_state.json": "Metadata describing project state, features, requirements, and versioning for a chat application."
}