{
  "backend/main.mo": "Motoko canister implementing user profiles and social features including friend requests, access control, and profile storage.",
  "feature_evidence.json": "Machine-readable report linking features to associated frontend files, components, and test IDs for build tracking.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend files describing their responsibilities and key UI behaviors.",
  "frontend/index.css": "Tailwind base layer defining app-wide CSS variables for themes, colors, and layout styling.",
  "frontend/index.html": "Basic HTML entry point loading the root React application and main script.",
  "frontend/src/App.tsx": "Main React app container handling authentication, profile setup, room selection, dialogs, and global UI.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth button component integrating Internet Identity login/logout with React Query cache clearing.",
  "frontend/src/components/chat/InviteToRoomDialog.tsx": "Dialog for inviting friends to a room, showing profiles, handling adds, and supporting profile viewer dialogs.",
  "frontend/src/components/chat/MessageComposer.tsx": "Provides a form to compose and send text or image messages, handling validation, preview, upload progress, and submission to a room.",
  "frontend/src/components/chat/MessageThread.tsx": "Displays a message thread with user profiles, images, auto‑scrolling, and tabbed chat/voice views for a selected room.",
  "frontend/src/components/chat/RoomList.tsx": "Lists available rooms and servers and includes forms to create new ones with validation, loading states, and selection handling.",
  "frontend/src/components/friends/FriendsDialog.tsx": "Implements a dialog for viewing friends, searching users, and sending friend requests with profile previews and loading states.",
  "frontend/src/components/profile/FlagBadge.tsx": "Empty file placeholder for a profile flag badge component.",
  "frontend/src/components/profile/ProfileEditorDialog.tsx": "Dialog for editing a user's profile with name, bio, avatar color, and profile picture upload with preview and progress tracking.",
  "frontend/src/components/profile/ProfileName.tsx": "Renders a user's display name from their profile.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial setup dialog for creating a new user profile with name and optional bio before using the app.",
  "frontend/src/components/profile/ProfileViewerDialog.tsx": "Dialog that loads and displays a user profile with fallbacks, showing avatar, name, bio, and picture if available.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar using a profile picture when possible, falling back to an initials-based colored avatar.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Settings dialog for theme, polling interval, and alt account linking, with related mutations and validation.",
  "frontend/src/components/voice/VoicePanel.tsx": "Voice chat panel managing WebRTC session setup, mic permissions, signaling, and ICE handling for a room.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on change.",
  "frontend/src/hooks/useAltAccounts.ts": "Hooks for querying and mutating linked alt accounts and pending requests using the backend actor.",
  "frontend/src/hooks/useChatRooms.ts": "Hooks for listing chat rooms and creating new rooms through the backend actor.",
  "frontend/src/hooks/useFriends.ts": "Hooks for user search, fetching friends, and sending or accepting friend requests via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity auth, including loading, login, logout, and auth-client setup.",
  "frontend/src/hooks/useRoomMembers.ts": "Defines a mutation hook to add a user to a room and invalidates the rooms query on success.",
  "frontend/src/hooks/useRoomMessages.ts": "Implements hooks for fetching room messages with polling and posting new messages with cache invalidation.",
  "frontend/src/hooks/useServers.ts": "Hooks for listing servers belonging to the current user and creating new servers with cache updates.",
  "frontend/src/hooks/useUserPreferences.ts": "Empty placeholder file for future user preference hooks.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update user profiles, including caller and arbitrary users, with caching and error handling.",
  "frontend/src/hooks/useVoiceSession.ts": "Exposes hooks for managing voice session state and signaling (start, end, SDP, ICE) with query invalidation.",
  "frontend/src/index.css": "Tailwind CSS base with extensive light, dark, and black theme variables and custom design tokens.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/altAccountSwitch.ts": "Provides helpers for storing and retrieving an alternate-account switch intent in sessionStorage.",
  "frontend/src/utils/flags.ts": "Empty placeholder file for feature flags.",
  "frontend/src/utils/principalDisplay.ts": "Utilities for formatting principal strings into display names and initials for UI fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters, persisting them in sessionStorage, and manipulating hash-based params.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom OKLCH color variables, typography, container settings, and plugins. Sets up dark mode, content paths, and extended color palettes for UI components.",
  "project_state.json": "Project metadata describing app goals, architectural notes, known issues, and implemented features for the TerrorChat application. Includes versioning and planning details for branding, authentication, UI themes, and user profile behavior."
}