{
  "backend/main.mo": "Motoko canister implementing user profiles, access control, friend requests, and user search with blob storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping branding‑related requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of main frontend components, hooks, styling, and index files.",
  "frontend/index.css": "Tailwind base layer defining warm color tokens and light/dark theme variables using OKLCH values.",
  "frontend/index.html": "Static HTML entrypoint with Tchat-branded document title and root mount point.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup, navigation dialogs, room selection, and global layout branding for Tchat.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating Internet Identity with React Query cache clearing and status handling.",
  "frontend/src/components/chat/InviteToRoomDialog.tsx": "Dialog for inviting friends to a chat room, showing friend profiles and performing room membership mutations.",
  "frontend/src/components/chat/MessageComposer.tsx": "Provides a form to compose and send chat messages with optional image upload, preview, and progress tracking.",
  "frontend/src/components/chat/MessageThread.tsx": "Displays messages for a room with auto-scrolling, sender info, image rendering, and a composer for new messages.",
  "frontend/src/components/chat/RoomList.tsx": "Lists chat rooms and allows creating new ones, selecting rooms, and viewing basic room metadata.",
  "frontend/src/components/friends/FriendsDialog.tsx": "Shows a dialog for viewing friends, searching users, and sending friend requests with profile previews.",
  "frontend/src/components/profile/ProfileEditorDialog.tsx": "Lets users edit their profile details, avatar color, and profile picture with image upload and preview handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial setup dialog where new users enter basic profile information and save it to the backend.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar using a profile image when available or falls back to a styled initial-based avatar.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Provides a dialog for adjusting theme and message polling interval, saving changes through form submission.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating related queries when it changes.",
  "frontend/src/hooks/useChatRooms.ts": "Hooks for listing chat rooms and creating new ones, updating cached room data after mutations.",
  "frontend/src/hooks/useFriends.ts": "Hooks for searching users, fetching friends, and handling friend request actions with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and related state.",
  "frontend/src/hooks/useRoomMembers.ts": "Mutation hook for adding users to a room and refreshing the room list afterward.",
  "frontend/src/hooks/useRoomMessages.ts": "Hooks for fetching room messages with optional polling and posting new messages with cache updates.",
  "frontend/src/hooks/useUserPreferences.ts": "Empty file with no implemented logic.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving and updating user profiles, including the caller's profile and specific user profiles.",
  "frontend/src/index.css": "Tailwind base styles plus light and dark theme CSS variables defining the app’s color palette.",
  "frontend/src/main.tsx": "Initializes React app root and wraps it with query and identity providers before rendering.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), storing them in sessionStorage, and clearing them as needed.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom themes, colors, fonts, container settings, plugins, and animations for the frontend.",
  "project_state.json": "Stores the project’s current state, including versioning, feature definitions, architectural notes, and requirements mappings."
}