{
  "backend/main.mo": "Main backend canister managing user profiles, flag validation, authorization, and social features like friend requests.",
  "feature_evidence.json": "Feature evidence report listing implemented flag-image features, linked files, components, and test IDs.",
  "frontend-file-summaries.txt": "Human‐written summaries of various frontend source files used for build planning.",
  "frontend/index.css": "Global CSS defining warm OKLCH color tokens, theming variables, and Tailwind base styles.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app shell handling authentication, profile setup, dialogs, and layout with header and room/message views.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and query cache clearing.",
  "frontend/src/components/chat/InviteToRoomDialog.tsx": "Dialog for inviting friends to rooms, showing user profiles or fallbacks and performing add-to-room actions.",
  "frontend/src/components/chat/MessageComposer.tsx": "Message input component allowing text and image messages with validation, preview, upload progress, and submission handling.",
  "frontend/src/components/chat/MessageThread.tsx": "Displays messages for a room with auto‑scroll, sender info, attachments, and error/empty states.",
  "frontend/src/components/chat/RoomList.tsx": "Lists chat rooms and provides a form to create new rooms with loading, error, and selection handling.",
  "frontend/src/components/friends/FriendsDialog.tsx": "Dialog for searching users, viewing friends, and sending friend requests with profile fallback handling.",
  "frontend/src/components/profile/FlagBadge.tsx": "Shows a small flag image for a valid profile flag or nothing if invalid.",
  "frontend/src/components/profile/ProfileEditorDialog.tsx": "Dialog for editing a user profile including name, bio, colors, profile picture upload, and flag selection.",
  "frontend/src/components/profile/ProfileName.tsx": "Inline display of a user's name with an optional flag badge.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Modal form for creating a user profile with name and bio, saving via mutation and showing toast feedback.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user's avatar using a profile picture if available, otherwise shows initials with configured colors.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Dialog for adjusting theme and message polling interval with validation and immediate state updates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useChatRooms.ts": "Provides hooks for listing rooms and creating rooms via actor methods with query invalidation.",
  "frontend/src/hooks/useFriends.ts": "Hooks for searching users, retrieving friends, and handling friend request mutations using the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication and exposing identity state and actions.",
  "frontend/src/hooks/useRoomMembers.ts": "Mutation hook to add a user to a room and invalidate the room list on success.",
  "frontend/src/hooks/useRoomMessages.ts": "Hooks to fetch room messages with polling and post new messages while invalidating relevant caches.",
  "frontend/src/hooks/useUserPreferences.ts": "Empty placeholder file for user preference hooks.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving user profiles with caching, error handling, and cache updates.",
  "frontend/src/index.css": "Defines Tailwind layers and theme CSS variables for light and dark modes using OKLCH values, plus global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and the InternetIdentityProvider, then renders App.",
  "frontend/src/utils/flags.ts": "Provides a strict allowlist of safe flag options with lookup and validation helpers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors tied to CSS variables, plugins, and container settings.",
  "project_state.json": "Tracks project metadata, requirements, constraints, branding notes, and existing features."
}