{
  "backend/main.mo": "Motoko canister managing user profiles, access control, and social features such as friend requests and friendships.",
  "feature_evidence.json": "Feature evidence listing two emoji‑picker flag‑related features, their associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "JSON-style text file mapping frontend file paths to short human-written summaries of their purposes.",
  "frontend/index.css": "Tailwind base/theme variable definitions for light and dark modes with extensive OKLCH color tokens.",
  "frontend/index.html": "Basic HTML entrypoint loading the React app and mounting it into the root div.",
  "frontend/src/App.tsx": "Main React app component handling authentication, profile checks, server/room selection, dialogs, and global UI state.",
  "frontend/src/components/auth/LoginButton.tsx": "Button component that manages Internet Identity login/logout with loading states and React Query cache clearing.",
  "frontend/src/components/chat/EmojiPicker.tsx": "Emoji picker component with multiple categories and a dedicated safe‑filtered Flags category using allowed flag utilities.",
  "frontend/src/components/chat/InviteToRoomDialog.tsx": "Dialog for inviting friends to a room, showing friend profiles and allowing adding them with loading and error handling.",
  "frontend/src/components/chat/MessageComposer.tsx": "Composer for sending text, image, or video messages with previews, validation, emoji insertion, and upload progress.",
  "frontend/src/components/chat/MessageThread.tsx": "Displays room messages with profile viewing, editing, deleting, and pinning, plus composer and room activity panels.",
  "frontend/src/components/chat/RoomList.tsx": "Lists rooms and servers with creation, selection, deletion, and rename dialogs, handling limits and errors.",
  "frontend/src/components/chat/RoomMemberListPanel.tsx": "Shows room members with presence, roles, and profile data, supporting role changes and member kicking.",
  "frontend/src/components/friends/FriendsDialog.tsx": "Dialog for viewing friends, searching users, and sending friend requests with profile previews.",
  "frontend/src/components/profile/FlagBadge.tsx": "Empty file placeholder for a profile flag badge component.",
  "frontend/src/components/profile/ProfileEditorDialog.tsx": "Dialog allowing users to edit their profile, upload an avatar, and update name, bio, and colors.",
  "frontend/src/components/profile/ProfileName.tsx": "Simple component that displays a user's profile name.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial setup dialog where new users create a basic profile with name, bio, and avatar color.",
  "frontend/src/components/profile/ProfileViewerDialog.tsx": "Dialog for viewing another user's profile with fallback display when no profile exists.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user's avatar, using a profile picture or falling back to initials and colors.",
  "frontend/src/components/servers/ServerAnnouncementThread.tsx": "Displays server announcements with support for posting, editing, deleting, and pinning messages.",
  "frontend/src/components/servers/ServerAvatar.tsx": "Server avatar component showing either an icon or fallback initials.",
  "frontend/src/components/servers/ServerChatView.tsx": "Renders the main server chat UI with tabs for chat and server details, fetching announcements, members, and updating user presence. Includes a member list panel and integrates identity-based user state.",
  "frontend/src/components/servers/ServerMemberList.tsx": "Displays server members with avatars, activity states, and owner badges, and includes placeholder moderation actions not yet supported by the backend. Fetches profile data per member and shows UI dialogs for actions.",
  "frontend/src/components/servers/ServerView.tsx": "Provides UI for editing server icon, banner, bio, and accent color with upload handling and progress tracking. Uses backend mutation hooks to update server customization fields.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Implements a settings modal for theme selection, polling interval, and managing linked alt accounts including switching, accepting, and unlinking. Fetches user/admin state and provides confirmation dialogs for sensitive actions.",
  "frontend/src/components/voice/VoicePanel.tsx": "Handles joining and managing a WebRTC-based voice session with microphone permission, SDP offer/answer exchange, and ICE candidate handling. Manages connection lifecycle, mute state, and session polling.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the current identity, initializing access control and invalidating dependent queries when the actor changes. Returns the actor along with loading state.",
  "frontend/src/hooks/useAdmin.ts": "Provides hooks to check whether the caller is an admin and to trigger admin-claim behavior, updating cached admin state via react-query. Depends on the actor returned by useActor.",
  "frontend/src/hooks/useAltAccounts.ts": "React Query hooks for fetching, linking, accepting, and unlinking alternate accounts, with cache invalidation on changes.",
  "frontend/src/hooks/useChatRooms.ts": "Hooks to list, fetch, create, and delete chat rooms using the backend actor with query invalidation.",
  "frontend/src/hooks/useFriends.ts": "Hooks for searching users, retrieving friends, and sending or accepting friend requests via the actor API.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity login, stored identities, and auth client configuration.",
  "frontend/src/hooks/useRoomMembers.ts": "Mutation hook to add users to a room and refresh the room list after updates.",
  "frontend/src/hooks/useRoomMessages.ts": "Hooks for fetching, posting, editing, deleting, and pinning room messages with polling and cache updates.",
  "frontend/src/hooks/useRoomPresence.ts": "Hooks to fetch room presence, update presence, and send periodic presence heartbeats.",
  "frontend/src/hooks/useRoomRoles.ts": "Hooks to fetch room members with roles and assign or remove members via backend mutations.",
  "frontend/src/hooks/useServerChat.ts": "Hooks for managing server announcements including fetching, posting, editing, deleting, and pinning messages.",
  "frontend/src/hooks/useServerCustomization.ts": "React-query hooks for getting and setting server bio, banner, and accent color with cache invalidation.",
  "frontend/src/hooks/useServerMembers.ts": "Hooks for fetching active server members and resolving their profiles with fallbacks.",
  "frontend/src/hooks/useServers.ts": "Hooks to list, create, delete servers, and set server icons using react-query.",
  "frontend/src/hooks/useUserPreferences.ts": "Empty placeholder file for user preferences hooks.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving user profiles, including caller and arbitrary principals.",
  "frontend/src/hooks/useVoiceSession.ts": "Hooks for managing voice session state and signaling (start, end, SDP, ICE) with polling.",
  "frontend/src/index.css": "Tailwind CSS setup with extensive theme variables for light, dark, and black modes.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and Internet Identity provider.",
  "frontend/src/utils/altAccountSwitch.ts": "Utility for storing and retrieving account switch intent in sessionStorage.",
  "frontend/src/utils/emojiFlags.ts": "Allowlist of Unicode flag emojis with labels for safe emoji selection.",
  "frontend/src/utils/flags.ts": "Empty placeholder flags utility file.",
  "frontend/src/utils/principalDisplay.ts": "Helpers to format principal strings into display names and initials.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read URL parameters, persist them in sessionStorage, and optionally remove parameters from hash-based URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, container settings, and enabling plugins like typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the TerrorChat app’s goals, architecture notes, known issues, and existing feature records."
}