{
  "backend/main.mo": "Defines the main backend actor with access control, user profiles, user preferences, and chat rooms/messages, including CRUD APIs with authorization checks.",
  "backend/migration.mo": "Provides a migration function converting old user profiles to the new profile and preference formats during upgrades.",
  "feature_evidence.json": "Lists feature evidence records linking implemented features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten textual summaries of all frontend files for reference or documentation.",
  "frontend/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes using a warm OKLCH palette.",
  "frontend/index.html": "Basic HTML entrypoint loading the React application into the root div.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup/editing, settings, room selection, and theme/polling application.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button integrating with Internet Identity and clearing React Query cache on logout.",
  "frontend/src/components/chat/MessageComposer.tsx": "Message input form that validates, submits messages, and supports Enter/Shift+Enter shortcuts.",
  "frontend/src/components/chat/MessageThread.tsx": "Displays chat messages for a room with auto‑scroll, loading skeletons, error state, and a composer when a room is selected.",
  "frontend/src/components/chat/RoomList.tsx": "Lists chat rooms, allows creating a new room, and handles loading, error, and selection states.",
  "frontend/src/components/profile/ProfileEditorDialog.tsx": "Dialog for editing user profile fields and avatar colors with live preview and save handling.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial setup dialog that collects a display name and bio and saves a default avatar profile.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a circular avatar using profile colors and initials with configurable sizes.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Dialog for updating user preferences such as theme and message polling interval, applying changes immediately.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useChatRooms.ts": "Provides hooks to list rooms and create new rooms using the backend actor with React Query caching.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login state and persistent identity loading.",
  "frontend/src/hooks/useRoomMessages.ts": "Defines hooks to fetch and poll room messages and to post new messages using React Query and an actor API.",
  "frontend/src/hooks/useUserPreferences.ts": "Implements hooks to get and update caller-specific user preferences with defaults and React Query caching.",
  "frontend/src/hooks/useUserProfile.ts": "Provides hooks to fetch and update user profiles, including the caller’s profile and cached lookups for other users.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom light/dark OKLCH color theme with global styling variables.",
  "frontend/src/main.tsx": "Bootstraps the React app, wiring QueryClient and InternetIdentityProvider around the root component.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and CSS variables.",
  "project_state.json": "Metadata describing current project state, features, and versioning for a chat application."
}