{
  "backend/main.mo": "Defines the main actor handling user profiles, storage, authorization, and friend request logic with permission checks.",
  "backend/migration.mo": "Provides a migration function that converts old user profiles to the new profile format by removing deprecated fields.",
  "feature_evidence.json": "Lists feature evidence records showing which frontend files implement flag‑removal features and their associated metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend components, hooks, and utilities used throughout the app.",
  "frontend/index.css": "Defines global Tailwind-based theme variables and styles for both light and dark modes using warm color palettes.",
  "frontend/index.html": "HTML entry point that loads the Tchat application via the main React script.",
  "frontend/src/App.tsx": "Main React application component managing authentication flow, dialogs, layout, and routing between chat and profile features.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component handling login/logout with Internet Identity and React Query cache clearing.",
  "frontend/src/components/chat/InviteToRoomDialog.tsx": "Dialog for inviting friends to chat rooms, showing user profiles, fallbacks, and handling invite actions with loading states.",
  "frontend/src/components/chat/MessageComposer.tsx": "Text and image message composer with validation, preview, upload tracking, and submit handling for a chat room.",
  "frontend/src/components/chat/MessageThread.tsx": "Displays a scrollable chat thread with message bubbles, profile lookups, error/loading states, and an invite dialog.",
  "frontend/src/components/chat/RoomList.tsx": "Lists chat rooms with loading/error states and includes a form for creating and selecting rooms.",
  "frontend/src/components/friends/FriendsDialog.tsx": "Dialog for viewing friends, searching users, and sending friend requests with profile and loading states.",
  "frontend/src/components/profile/FlagBadge.tsx": "Empty placeholder file for a profile flag badge component.",
  "frontend/src/components/profile/ProfileEditorDialog.tsx": "Profile editing dialog allowing name, bio, avatar color, and image upload with preview and validation.",
  "frontend/src/components/profile/ProfileName.tsx": "Simple component that renders a user's display name.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial profile setup dialog for creating a basic user profile with name and bio.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar using a profile picture when available or falls back to an initial-based colored avatar with size variants.",
  "frontend/src/components/settings/SettingsDialog.tsx": "Provides a dialog for updating theme and message polling interval, applying changes and persisting them via callbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useChatRooms.ts": "Exposes hooks to list chat rooms and create new rooms, updating cached room data on mutations.",
  "frontend/src/hooks/useFriends.ts": "Defines hooks for searching users, fetching friends, and handling friend request actions with cache updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements context and utilities for managing Internet Identity login, stored identities, and auth client lifecycle.",
  "frontend/src/hooks/useRoomMembers.ts": "Provides a mutation hook to add a user to a room and invalidates room data afterward.",
  "frontend/src/hooks/useRoomMessages.ts": "Fetches room messages with optional polling and posts new messages, invalidating affected message queries.",
  "frontend/src/hooks/useUserPreferences.ts": "Empty file with no implementation.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for retrieving and saving user profiles, updating related cached profile data on changes.",
  "frontend/src/index.css": "Global Tailwind setup defining light and dark theme color variables and base styles.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, identity provider, and global styles.",
  "frontend/src/utils/flags.ts": "Empty file with no implementation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing) and persisting them in sessionStorage, plus utilities to clear them.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS themes, colors, fonts, plugins, animations, and container settings for the frontend.",
  "project_state.json": "Describes the project’s current state, features, issues, and architectural notes for the chat application."
}