{
  "backend/main.mo": "Motoko backend actor providing user profiles, access control, profile search, and friend request management with persistent maps.",
  "feature_evidence.json": "Metadata report mapping a feature request to related frontend files, components, tests, and confidence level.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of various frontend components, hooks, and utilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining theme variables for light and dark modes with a terracotta/amber palette.",
  "frontend/index.html": "HTML entry point loading the React application with the Tchat title.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, UI dialogs, theme provider, and chat layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Auth button handling Internet Identity login/logout with React Query cache clearing.",
  "frontend/src/components/chat/InviteToRoomDialog.tsx": "Dialog for inviting friends to rooms, showing profiles or fallbacks and adding users via hooks.",
  "frontend/src/components/chat/MessageComposer.tsx": "Provides a chat input form allowing text and image messages with validation, previews, and upload progress before sending to a room.",
  "frontend/src/components/chat/MessageThread.tsx": "Displays messages for a room with avatars, images, auto‑scrolling, and an invite dialog, handling loading and errors.",
  "frontend/src/components/chat/RoomList.tsx": "Lists chat rooms, supports room selection, and includes a form for creating new rooms with loading and error states.",
  "frontend/src/components/friends/FriendsDialog.tsx": "Implements a dialog for searching users, viewing friends, and sending friend requests with profile loading states.",
  "frontend/src/components/profile/FlagBadge.tsx": "Empty placeholder file.",
  "frontend/src/components/profile/ProfileEditorDialog.tsx": "Dialog for editing user profile details including name, bio, avatar color, and optional profile picture upload with preview.",
  "frontend/src/components/profile/ProfileName.tsx": "Renders a user’s display name from their profile.",
  "frontend/src/components/profile/ProfileSetupDialog.tsx": "Initial profile creation dialog collecting name and bio before saving a new user profile.",
  "frontend/src/components/profile/UserAvatar.tsx": "Renders a user avatar, showing a profile picture when available or falling back to initials with themed styling.",
  "frontend/src/components/settings/SettingsDialog.tsx": "A modal dialog allowing users to change theme and message polling interval, with form validation and persistence.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useChatRooms.ts": "Provides hooks to list and create chat rooms via the backend actor with automatic cache invalidation.",
  "frontend/src/hooks/useFriends.ts": "Contains hooks for searching users, fetching friends, and sending or accepting friend requests through the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an auth provider and hooks for managing Internet Identity login state, persistence, and client creation.",
  "frontend/src/hooks/useRoomMembers.ts": "Provides a mutation hook to add users to a room and refresh room lists afterward.",
  "frontend/src/hooks/useRoomMessages.ts": "Exposes hooks for fetching room messages with optional polling and posting new messages with targeted cache invalidation.",
  "frontend/src/hooks/useUserPreferences.ts": "Empty placeholder file for user preference hooks.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and updating user profiles, including caller profile caching and safe remote fetch handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom color themes for light, dark, and black modes using CSS variables.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders the root component.",
  "frontend/src/utils/flags.ts": "Empty utility file reserved for flag-related logic.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL params (including hash), persist them in sessionStorage, and clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS config defining theme extensions, colors, fonts, animations, and plugin usage.",
  "project_state.json": "Stores project state metadata, feature list, issues, and architectural notes for the chat app."
}