{
  "kind": "build_request",
  "title": "Add flag emojis (including non-recognized/partially-recognized territories where Unicode supports them) to the emoji picker",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-114",
      "text": "Add a dedicated \"Flags\" category to the existing emoji picker (frontend/src/components/chat/EmojiPicker.tsx) so users can insert flag emojis into messages, including flags for non-recognized/partially-recognized territories when they are available as standard Unicode emoji.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "add flag emojis too including the flags of non recognized states"
        ]
      },
      "acceptanceCriteria": [
        "The emoji picker UI includes a visible \"Flags\" category header alongside existing categories.",
        "Selecting a flag emoji inserts it into the message composer text input at the current cursor position (works anywhere EmojiPicker is used, including room chat and server chat composers).",
        "The flags provided are standard Unicode emoji characters (no backend calls, no third-party APIs, no image assets required).",
        "If a requested/non-recognized entity has no standard Unicode flag emoji, it is not included (do not fabricate custom flag emojis)."
      ]
    },
    {
      "id": "REQ-115",
      "text": "Enforce a safety filter for the new flag-emoji list used by the emoji picker: do not include any extremist/terrorist/violent/hate-symbol flags or equivalents, and ensure the picker cannot be used to insert disallowed symbols via the Flags category.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-1"
        ],
        "quotes": [
          "add flag emojis too including the flags of non recognized states"
        ]
      },
      "acceptanceCriteria": [
        "The Flags category list is curated/filtered so it does not include extremist/terrorist/violent/hate-symbol flags.",
        "No user-facing text is added that promotes or endorses extremist/terrorist/violent/hate symbols; any added labels remain in English."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be modified: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui.",
    "Do not add WebSockets or real-time infrastructure; keep the existing polling-based approach unchanged.",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Do not reintroduce profile flag-badge functionality (profile editor flag selection and profile name flag rendering remain out of scope).",
    "Do not add or change any backend APIs or backend data models for flags.",
    "Do not add custom flag image assets to represent entities that do not have Unicode flag emojis."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}