{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin access UI and client-side message search",
  "requirements": [
    {
      "id": "REQ-112",
      "summary": "Add Settings UI to view/claim admin access and show an Admin indicator in the authenticated header.",
      "acceptanceCriteria": [
        "Settings dialog displays an “Admin access” section with current admin status for the signed-in principal.",
        "Clicking “Claim admin access” triggers the backend claim call and shows an English toast on success or a clear English error toast on failure.",
        "When the caller is an admin, the app header displays an “Admin” indicator; when not an admin, it does not.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdmin.ts",
          "operation": "create",
          "description": "Create react-query hooks for admin status and admin-claiming (query: isCallerAdmin; mutation: claim admin). Use the authorization component’s frontend guidance for handling authorization errors gracefully; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Update the typed backend interface to include the new backend capability used by the Settings UI for claiming admin access (and ensure isCallerAdmin is used consistently). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/settings/SettingsDialog.tsx",
          "operation": "modify",
          "description": "Add an “Admin access” section to the existing Settings dialog: show current status (“You are an admin” / “You are not an admin”) using the admin-status hook, and add a “Claim admin access” button wired to the claim mutation with English success/error toasts. Use existing shadcn-ui primitives already imported in this file; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire admin status into the authenticated header area: when admin, show a subtle English “Admin” indicator (e.g., small label/badge near the identity display). Ensure it is hidden for non-admins. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-113",
      "summary": "Add client-side “Search in chat” filtering for room messages and server announcements.",
      "acceptanceCriteria": [
        "In a room chat thread, entering a search term filters the displayed messages to those whose text content matches (case-insensitive match is acceptable).",
        "In a server chat thread, entering a search term filters the displayed announcements similarly.",
        "When a search yields no results, the UI shows a clear English message indicating no matches.",
        "Clearing the search term restores the full currently loaded message list."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/chat/MessageThread.tsx",
          "operation": "modify",
          "description": "Add a “Search messages…” input that filters the currently loaded room messages client-side (case-insensitive match against message.content), applied to both pinned and unpinned lists. Add an English empty-state message when no matches are found, and ensure clearing restores the full list. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/servers/ServerAnnouncementThread.tsx",
          "operation": "modify",
          "description": "Add a “Search messages…” input that filters the currently loaded server announcements client-side (case-insensitive match against announcement.content), applied to both pinned and unpinned lists. Add an English empty-state message when no matches are found, and ensure clearing restores the full list. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}