{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Saved server links (bookmarks) and account data export in TerrorChat (frontend)",
  "requirements": [
    {
      "id": "REQ-120",
      "summary": "Add React Query hooks for listing/saving/removing saved server links with cache invalidation and normalized errors.",
      "acceptanceCriteria": [
        "A new set of hooks exists (in the existing hooks style) to: fetch the caller’s saved server links, save a link, and remove a link.",
        "On successful save/remove, the saved-links query is invalidated so the UI refreshes immediately.",
        "Errors are normalized into readable English messages surfaced to the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useSavedServerLinks.ts",
          "operation": "create",
          "description": "Create React Query hooks using the existing authenticated actor pattern (authorization component) to call listSavedServerLinks/saveServerLink/removeSavedServerLink with a single stable query key (e.g., ['savedServerLinks']), plus readable English error normalization. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-121",
      "summary": "Allow users to save a generated server invite code/link from the existing ServerView invite UI.",
      "acceptanceCriteria": [
        "In `frontend/src/components/servers/ServerView.tsx`, after an invite link/code is generated, provide a clear action (e.g., \"Save link\") that saves the inviteCode (and a reasonable default label such as the server name) via the new saved-links mutation.",
        "Show an English success toast when saved, and an English error toast if saving fails.",
        "Prevent saving when there is no inviteCode present."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/servers/ServerView.tsx",
          "operation": "modify",
          "description": "Add a \"Save link\" action in the Invite section that is enabled only when inviteCode exists; call the saved-link mutation (from useSavedServerLinks) to persist the invite code for the current server, and show English success/error toasts. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-122",
      "summary": "Add a Settings section to list/copy/open/remove the user's saved server links with loading/empty states and confirmation on removal.",
      "acceptanceCriteria": [
        "In `frontend/src/components/settings/SettingsDialog.tsx`, add a \"Saved server links\" section below existing sections.",
        "The section lists saved server links (label + invite code, and/or a derived full URL) with actions: Copy, Open, and Remove.",
        "Copy uses the clipboard API and shows an English success/error toast.",
        "Open navigates the user to the invite flow using the same invite parameter pattern already used by the app (e.g., `?invite=...`).",
        "Remove prompts for confirmation (English) before deleting, then removes via backend and refreshes the list.",
        "Show appropriate loading/empty states in English (e.g., \"Loading saved links...\", \"No saved links yet.\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/SettingsDialog.tsx",
          "operation": "modify",
          "description": "Add a \"Saved server links\" section below existing sections. Use useSavedServerLinks to load and render items, derive a full invite URL using the same `?invite=...` pattern already used in App, implement Copy (clipboard + toasts), Open (navigate to the invite URL, e.g., via window.location.assign), and Remove with an English confirmation dialog and post-delete refresh via React Query invalidation. Optionally map serverId to a friendly server name by using the existing servers list hook for a better label display. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-123",
      "summary": "Add an Account data section in Settings that displays/copies the current Principal and exports a local JSON backup containing principal, profile, alt accounts, and saved links.",
      "acceptanceCriteria": [
        "In `frontend/src/components/settings/SettingsDialog.tsx`, add an \"Account data\" section with: (1) the user’s current Principal displayed in a monospace field and a \"Copy\" button, and (2) an \"Export\" button that downloads a JSON file.",
        "The export JSON includes at minimum: principal string, current caller profile (if available), linked alt accounts (if available), and saved server links.",
        "All user-facing text is English, with clear success/error toasts (e.g., \"Account data exported\" / \"Failed to export account data\").",
        "Export works fully client-side (downloaded file) and does not require any third-party services."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/SettingsDialog.tsx",
          "operation": "modify",
          "description": "Add an \"Account data\" section that reads the current Principal from the Internet Identity context, shows it in a monospace field with a Copy button (clipboard + English toasts), and adds an Export button that downloads a client-side JSON file containing: principal string, current caller profile (if available via existing profile hook), linked alt accounts (if available via existing alt-accounts hooks), and saved server links (via useSavedServerLinks). Include English success/error toasts for export. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}