{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add a Flags category with curated Unicode flag emojis to the emoji picker",
  "requirements": [
    {
      "id": "REQ-114",
      "summary": "Add a dedicated \"Flags\" category to EmojiPicker so users can insert standard Unicode flag emojis (including Unicode-supported non/partially-recognized territories) into any message composer at the cursor position.",
      "acceptanceCriteria": [
        "The emoji picker UI includes a visible \"Flags\" category header alongside existing categories.",
        "Selecting a flag emoji inserts it into the message composer text input at the current cursor position (works anywhere EmojiPicker is used, including room chat and server chat composers).",
        "The flags provided are standard Unicode emoji characters (no backend calls, no third-party APIs, no image assets required).",
        "If a requested/non-recognized entity has no standard Unicode flag emoji, it is not included (do not fabricate custom flag emojis)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/emojiFlags.ts",
          "operation": "create",
          "description": "Add a curated, static list of allowed standard Unicode flag emojis for use in the emoji picker (including widely-supported extra Unicode flags such as UN/EU and Unicode-supported territories), with no network calls or assets involved."
        },
        {
          "path": "frontend/src/components/chat/EmojiPicker.tsx",
          "operation": "modify",
          "description": "Add a visible \"Flags\" category header and render the curated Unicode flag emoji list from frontend/src/utils/emojiFlags.ts as a new category in the existing emoji picker UI. Ensure selection continues to call onSelect(emoji) so insertion works anywhere EmojiPicker is used (e.g., MessageComposer and ServerAnnouncementThread)."
        }
      ]
    },
    {
      "id": "REQ-115",
      "summary": "Enforce a safety filter/allowlist so the Flags category cannot display or insert extremist/terrorist/violent/hate-symbol flags or equivalents.",
      "acceptanceCriteria": [
        "The Flags category list is curated/filtered so it does not include extremist/terrorist/violent/hate-symbol flags.",
        "No user-facing text is added that promotes or endorses extremist/terrorist/violent/hate symbols; any added labels remain in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/emojiFlags.ts",
          "operation": "modify",
          "description": "Implement an explicit allowlist-based safety filter for the Flags category (and any minimal supporting helpers) so only the curated set of Unicode flag emojis is exposed to the picker, excluding extremist/terrorist/violent/hate-symbol flags or equivalents."
        },
        {
          "path": "frontend/src/components/chat/EmojiPicker.tsx",
          "operation": "modify",
          "description": "Ensure the Flags category uses only the allowlisted values from frontend/src/utils/emojiFlags.ts and add a defensive guard so the picker cannot insert any emoji through the Flags category unless it is in the allowlist."
        }
      ]
    }
  ]
}