{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove profile flag badge feature from backend and UI",
  "requirements": [
    {
      "id": "REQ-44",
      "summary": "Remove all flag-badge UI from profile editor and name display surfaces so no flag is shown or saved.",
      "acceptanceCriteria": [
        "`frontend/src/components/profile/ProfileEditorDialog.tsx` no longer shows a \"Flag Badge\" field and does not send any flag value when saving a profile.",
        "`frontend/src/components/profile/ProfileName.tsx` renders only the display name (no flag badge).",
        "The app header greeting, message thread sender names, friends UI, and invite UI no longer render any flag badge next to a user’s name.",
        "All user-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/ProfileEditorDialog.tsx",
          "operation": "modify",
          "description": "Remove the flag selector UI and related state; remove any reads of a legacy profile flag from loaded profiles; ensure the saved UserProfile object does not include any flag-related field; update dialog description copy to remove mention of flags while keeping all other profile fields/behavior unchanged."
        },
        {
          "path": "frontend/src/components/profile/ProfileName.tsx",
          "operation": "modify",
          "description": "Remove FlagBadge usage and any reliance on a profile flag field so the component renders only the user's display name; keep inline layout/truncation behavior intact for all call sites (header, message thread, friends, invite)."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Eliminate frontend flag allowlist and renderer dependencies so the app has no runtime dependency on flag assets/metadata.",
      "acceptanceCriteria": [
        "The app no longer imports/uses `frontend/src/utils/flags.ts` and no longer imports/uses `frontend/src/components/profile/FlagBadge.tsx`.",
        "The frontend builds successfully with no references to `/assets/generated/flag-*.png` in TypeScript/TSX source.",
        "Profile save/load flows continue working end-to-end (create/edit profile still works; avatars and profile pictures still work)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/profile/FlagBadge.tsx",
          "operation": "delete",
          "description": "Delete the flag badge renderer component since the UI no longer renders flags anywhere."
        },
        {
          "path": "frontend/src/utils/flags.ts",
          "operation": "delete",
          "description": "Delete flag allowlist/validation utilities so the frontend no longer contains flag metadata or any references to generated flag assets."
        },
        {
          "path": "frontend/src/components/profile/ProfileEditorDialog.tsx",
          "operation": "modify",
          "description": "Remove all imports and logic that depended on `utils/flags` and `FlagBadge` to ensure there are no remaining TypeScript/TSX references to flag assets or flag metadata."
        },
        {
          "path": "frontend/src/components/profile/ProfileName.tsx",
          "operation": "modify",
          "description": "Remove the `FlagBadge` import and any `profileFlag` access so there are no remaining references to the deleted flag components/utilities."
        }
      ]
    }
  ]
}