{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add additional theme options in Settings (include Black theme)",
  "requirements": [
    {
      "id": "REQ-46",
      "summary": "Add a Black theme option to Settings and implement a matching CSS variable palette so the entire app updates via next-themes class switching.",
      "acceptanceCriteria": [
        "In Settings, the Theme dropdown includes a new option labeled \"Black\" (English text).",
        "Selecting \"Black\" calls the existing theme application mechanism (next-themes) using a stable theme value (e.g., \"black\").",
        "A corresponding `.black` theme class is defined in `frontend/src/index.css` that sets `--background` to a true/near-true black and updates related variables (`--foreground`, `--card`, `--border`, `--muted`, etc.) so text and UI controls remain readable and consistent.",
        "When the Black theme is selected, the app UI (header, sidebar, dialogs, message thread, and inputs) visibly switches to the Black palette without breaking contrast or readability.",
        "Existing theme options (Light, Dark, System Default) continue to work as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/settings/SettingsDialog.tsx",
          "operation": "modify",
          "description": "Extend the Theme selector to include a new SelectItem labeled \"Black\" with a stable value \"black\", ensuring the existing next-themes setTheme flow applies it and existing Light/Dark/System options remain unchanged."
        },
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Define a new `.black` theme class in the @layer base section that sets a near-true black `--background` and adjusts the full variable palette (`--foreground`, `--card`, `--popover`, `--muted`, `--border`, `--input`, `--ring`, and `--sidebar*`) to preserve readability/contrast across header, sidebar, dialogs, threads, and inputs."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the ThemeProvider configuration (next-themes) to explicitly support the new \"black\" theme value (while keeping defaultTheme=\"system\" and enableSystem behavior intact), so applying \"black\" results in the `.black` class being used consistently."
        }
      ]
    }
  ]
}