{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-12T19:39:27.808Z",
  "summary": "Diff adds a new frontend hook file for saved server links and implements backend/actor APIs for saving, listing, and removing links keyed per-caller. However, backend saved-link records do not match the requested schema (missing unique id, inviteCode naming, and optional label), lack input validation for empty invite codes, and use traps for error signaling. Frontend Settings UI/account export and ServerView integration are only partially evidenced due to truncation, though a summary file claims they exist.",
  "missing_requirements": [
    {
      "id": "REQ-119",
      "requirement": "Saved server link record must include a stable unique id, inviteCode (Text), optional label (Text), and savedAt timestamp.",
      "reason": "Backend type `SavedServerLink` contains `{ serverId; code; savedAt }` but no stable unique id, no `inviteCode` field name, and no optional `label`.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-119",
      "requirement": "Backend must return clear English errors for invalid input (e.g., empty invite code) and not-found removals.",
      "reason": "No validation for empty `code`/invite code is present; removal uses traps (e.g., \"No saved links found for user\", \"Link not found\") and save uses trap for duplicates, but explicit invalid-input handling (empty invite code) is not implemented.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-121",
      "requirement": "In ServerView, after generating an invite link/code, provide a clear action (e.g., \"Save link\") that saves the inviteCode (and default label like server name), shows success/error toasts, and prevents saving when no inviteCode is present.",
      "reason": "The diff snippet only shows `useSaveServerLink` imported/initialized; it does not show any UI control, toast handling, default label behavior, or a guard preventing save without an invite code.",
      "evidence": [
        "frontend/src/components/servers/ServerView.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added URL/session parameter utility helpers (persisting URL params into sessionStorage, clearing hash params, etc.).",
      "reason": "Not requested by any requirement related to saved server links or account data export; appears as a general URL parameter/session persistence utility change.",
      "evidence": [
        "frontend/src/utils/urlParams.ts"
      ]
    },
    {
      "description": "Backend introduces an additional `ServerBookmark` type duplicating saved link fields.",
      "reason": "Not requested; requirements only mention a saved server link record schema and APIs.",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.62,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/components/servers/ServerView.tsx",
    "frontend/src/components/settings/SettingsDialog.tsx",
    "frontend/src/hooks/useSavedServerLinks.ts",
    "frontend/src/utils/urlParams.ts",
    "project_state.json"
  ]
}